duxinglang-1/nRF9160_test/AURI/src/uart_ble/uart_ble.c
	if((buf[0] != PACKET_HEAD) || (buf[len-1] != PACKET_END))	//format is error
	{
		LOG_INF("format is error! HEAD:%x, END:%x\n", buf[0], buf[len-1]);
		return;
	}

	for(i=0;i<len-2;i++)
		CRC_data = CRC_data+buf[i];

	if(CRC_data != buf[len-2])									//crc is error
	{
		LOG_INF("CRC is error! data:%x, CRC:%x\n", buf[len-2], CRC_data);
		return;
	}

	data_len = buf[1]*256+buf[2];
	data_ID = buf[3]*256+buf[4];

	switch(data_ID)
	{
	case HEART_RATE_ID:			//心率
		APP_get_heart_rate(buf, len);
		break;
	case BLOOD_OXYGEN_ID:		//血氧
		break;
	case BLOOD_PRESSURE_ID:		//血压
		break;
	case ONE_KEY_MEASURE_ID:	//一键测量
		break;
	case PULL_REFRESH_ID:		//下拉刷新
		APP_get_current_data(buf, len);
		break;
	case SLEEP_DETAILS_ID:		//睡眠详情
		break;
	case FIND_DEVICE_ID:		//查找手环
		APP_set_find_device(buf, len);
		break;
	case SMART_NOTIFY_ID:		//智能提醒
		break;
	case ALARM_SETTING_ID:		//闹钟设置
		APP_set_alarm(buf, len);
		break;
	case USER_INFOR_ID:			//用户信息
		break;
	case SEDENTARY_ID:			//久坐提醒
		break;
	case SHAKE_SCREEN_ID:		//抬手亮屏
		APP_set_wake_screen_by_wrist(buf, len);
		break;
	case MEASURE_HOURLY_ID:		//整点测量设置
		APP_set_PHD_interval(buf, len);
		break;
	case SHAKE_PHOTO_ID:		//摇一摇拍照
		break;
	case LANGUAGE_SETTING_ID:	//中英日文切换
		APP_set_language(buf, len);
		break;
	case TIME_24_SETTING_ID:	//12/24小时设置
		APP_set_time_24_format(buf, len);
		break;
	case FIND_PHONE_ID:			//查找手机回复
		APP_reply_find_phone(buf, len);
		break;
	case WEATHER_INFOR_ID:		//天气信息下发
		break;
	case TIME_SYNC_ID:			//时间同步
		APP_set_date_time(buf, len);
		break;
	case TARGET_STEPS_ID:		//目标步数
		APP_set_target_steps(buf, len);
		break;
	case BATTERY_LEVEL_ID:		//电池电量
		APP_get_battery_level(buf, len);
		break;
	case FIRMWARE_INFOR_ID:		//固件版本号
		APP_get_firmware_version(buf, len);
		break;
	case FACTORY_RESET_ID:		//清除手环数据
		APP_set_factory_reset(buf, len);
		break;
	case ECG_ID:				//心电
		break;
	case LOCATION_ID:			//获取定位信息
		APP_get_location_data(buf, len);
		break;
	case DATE_FORMAT_ID:		//年月日格式
		APP_set_date_format(buf, len);
		break;
	case BLE_CONNECT_ID:		//BLE断连提醒
		ble_connect_or_disconnect_handle(buf, len);
		break;
	case CTP_NOTIFY_ID:
		CTP_notify_handle(buf, len);
		break;
	case GET_NRF52810_VER_ID:
		get_nrf52810_ver_response(buf, len);
		break;
	case GET_BLE_MAC_ADDR_ID:
		get_ble_mac_address_response(buf, len);
		break;
	case GET_BLE_STATUS_ID:
		get_ble_status_response(buf, len);
		break;
	case SET_BEL_WORK_MODE_ID:
		break;
	default:
		LOG_INF("data_id is unknown! \n");
		break;
	}
}

void ble_send_date_handle(u8_t *buf, u32_t len)
{
	LOG_INF("ble_send_date_handle\n");

#ifdef CONFIG_WIFI
	switch_to_ble();
#endif

	uart_fifo_fill(uart_ble, buf, len);
	uart_irq_tx_enable(uart_ble); 
}

static void uart_receive_data(u8_t data, u32_t datalen)
{
    if(blue_is_on)
    {
        rx_buf[rece_len++] = data;
        if(rece_len == (256*rx_buf[1]+rx_buf[2]+3))	
        {
            //ble_send_date_handle(rx_buf, rece_len);
            ble_receive_data_handle(rx_buf, rece_len);
            
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
        }
		
        if(data == 0x88)
        {
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
        }
    }
#ifdef CONFIG_WIFI	
    else if(wifi_is_on)
    {
       
        rx_buf[rece_len++] = data;
        if(rece_len==256)  
        {
            wifi_receive_data_handle(rx_buf, rece_len);

            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
        }

        if((rx_buf[rece_len-1] == 0X4B) || (rece_len==BUF_MAXSIZE-256))	
        {
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
        }      
   }
#endif	
}

void uart_send_data(void)
{
	LOG_INF("uart_send_data\n");
	
	uart_fifo_fill(uart_ble, "Hello World!", strlen("Hello World!"));
	uart_irq_tx_enable(uart_ble); 
}

static void uart_cb(struct device *x)
{
	u8_t tmpbyte = 0;
	u32_t len=0;

	uart_irq_update(x);

	if(uart_irq_rx_ready(x)) 
	{
		while((len = uart_fifo_read(x, &tmpbyte, 1)) > 0)
			uart_receive_data(tmpbyte, 1);
	}
	
	if(uart_irq_tx_ready(x))
	{
		struct uart_data_t *buf;
		u16_t written = 0;

		buf = k_fifo_get(&fifo_uart_tx_data, K_NO_WAIT);
		/* Nothing in the FIFO, nothing to send */
		if(!buf)
		{
			uart_irq_tx_disable(x);
			return;
		}

		while(buf->len > written)
		{
			written += uart_fifo_fill(x, &buf->data[written], buf->len - written);
		}

		while (!uart_irq_tx_complete(x))
		{
			/* Wait for the last byte to get
			* shifted out of the module
			*/
		}

		if (k_fifo_is_empty(&fifo_uart_tx_data))
		{
			uart_irq_tx_disable(x);
		}

		k_free(buf);
	}
}

void uart_sleep_out(void)
{
#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	if(uart_is_waked)
		return;
	
	device_set_power_state(uart_ble, DEVICE_PM_ACTIVE_STATE, NULL, NULL);
	uart_irq_rx_enable(uart_ble);
	uart_irq_tx_enable(uart_ble);

	uart_is_waked = true;
	k_timer_start(&uart_sleep_in_timer, K_MSEC(30*1000), NULL);

	LOG_INF("uart set active success!\n");
#endif
}

void uart_sleep_in(void)
{
#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	if(!uart_is_waked)
		return;
	
	uart_irq_rx_disable(uart_ble);
	uart_irq_tx_disable(uart_ble);
	device_set_power_state(uart_ble, DEVICE_PM_LOW_POWER_STATE, NULL, NULL);

	uart_is_waked = false;
	
	LOG_INF("uart set low power success!\n");
#endif
}

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
static void ble_interrupt_event(struct device *interrupt, struct gpio_callback *cb, u32_t pins)
{
	LOG_INF("ble_interrupt_event\n");
	uart_wake_flag = true;
}

void UartSleepInCallBack(struct k_timer *timer_id)
{
	LOG_INF("UartSleepInCallBack\n");
	uart_sleep_flag = true;
}
#endif

void ble_init(void)
{
	int flag = GPIO_DIR_IN|GPIO_INT|GPIO_INT_EDGE|GPIO_PUD_PULL_DOWN|GPIO_INT_ACTIVE_HIGH|GPIO_INT_DEBOUNCE;

	LOG_INF("ble_init\n");

	uart_ble = device_get_binding(BLE_DEV);
	if(!uart_ble)
	{
		LOG_INF("Could not get %s device\n", BLE_DEV);
		return;
	}
	
	uart_irq_callback_set(uart_ble, uart_cb);
	uart_irq_rx_enable(uart_ble);

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	gpio_ble = device_get_binding(BLE_PORT);
	if(!gpio_ble)
	{
		LOG_INF("Could not get %s port\n", BLE_PORT);
		return;
	}	
	gpio_pin_configure(gpio_ble, BLE_INT_PIN, flag);
	gpio_pin_disable_callback(gpio_ble, BLE_INT_PIN);
	gpio_init_callback(&gpio_cb, ble_interrupt_event, BIT(BLE_INT_PIN));
	gpio_add_callback(gpio_ble, &gpio_cb);
	gpio_pin_enable_callback(gpio_ble, BLE_INT_PIN);

	k_timer_start(&uart_sleep_in_timer, K_MSEC(3*60*1000), NULL);
#endif
}

void UartMsgProc(void)
{
#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	if(uart_wake_flag)
	{
		LOG_INF("uart_wake!\n");
		
		uart_wake_flag = false;
		uart_sleep_out();
	}

	if(uart_sleep_flag)
	{
		LOG_INF("uart_sleep!\n");

		uart_sleep_flag = false;
		
		if(!gps_is_working() && !MqttIsConnected())
		{
			uart_sleep_in();
		}
		else
		{
			k_timer_start(&uart_sleep_in_timer, K_MSEC(30*1000), NULL);
		}
	}
#endif	
}

void test_uart_ble(void)
{
	LOG_INF("test_uart_ble\n");
	
	//ble_init();

	while(1)
	{
		ble_send_date_handle("Hello World!\n", strlen("Hello World!\n"));
		k_sleep(K_MSEC(1000));
	}
}
